import React, { Component } from 'react';

class ChoiceLable extends Component {
  constructor(props) {
    super(props);

    this.state = { label: ['ตัวที่1', 'ตัวที่2', 'ตัวที่3', 'ตัวที่4', 'ตัวที่5',
    'ตัวที่6', 'ตัวที่7', 'ตัวที่8', 'ตัวที่9', 'ตัวที่10',
    'ตัวที่11', 'ตัวที่12', 'ตัวที่13', 'ตัวที่14', 'ตัวที่15',
    'ตัวที่16', 'ตัวที่17', 'ตัวที่18', 'ตัวที่19', 'ตัวที่20',
    'ตัวที่21', 'ตัวที่22', 'ตัวที่23', 'ตัวที่24', 'ตัวที่25',
    'ตัวที่26', 'ตัวที่27', 'ตัวที่28', 'ตัวที่29', 'ตัวที่30',
    'ตัวที่31', 'ตัวที่32', 'ตัวที่33', 'ตัวที่34', 'ตัวที่35',
    'ตัวที่36', 'ตัวที่37', 'ตัวที่38', 'ตัวที่39', 'ตัวที่40']
    };
  }

  render() {
    console.log(this.state.label)
    return (
      <>{this.state.label}</>
    );
  }
}

export default ChoiceLable;
